app/controllers/hotels_controller.rb

  def index
    if params[:term]
      @hotels = Hotel.search_by_hotel_name(params[:term]).page(params[:page1]).per Settings.paginate.hotels
---
SELECT  "hotels".* FROM "hotels" WHERE (wifi) AND (breakfast) AND (pool) LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "hotels" WHERE (wifi) AND (breakfast) AND (pool)

  def find_hotel
    @hotel = Hotel.find_by id: params[:id]
---
SELECT  "hotels".* FROM "hotels" WHERE "hotels"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]