app/views/hotels/index.html.erb

            <div class="col-md-7 abt-left">
              <% if hotel.hotel_pictures.first %>
---
SELECT  "hotel_pictures".* FROM "hotel_pictures" WHERE "hotel_pictures"."hotel_id" = $1 ORDER BY "hotel_pictures"."id" ASC LIMIT $2  [["hotel_id", 1], ["LIMIT", 1]]
SELECT  "hotels".* FROM "hotels" WHERE (wifi) AND (breakfast) AND (pool) LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]