app/views/hotels/show.html.erb

        <div class="col-sm-8 img-hotel-left">
						<%if @hotel.hotel_pictures && @hotel.hotel_pictures.first%>
---
SELECT  "hotel_pictures".* FROM "hotel_pictures" WHERE "hotel_pictures"."hotel_id" = $1 ORDER BY "hotel_pictures"."id" ASC LIMIT $2 OFFSET $3  [["hotel_id", 1], ["LIMIT", 1], ["OFFSET", 1]]