app/views/layouts/_header.html.erb


                    <p class="time"><%= link_to online_status(User.find_by(id: opp)), hotel_path(:id => conv.hotel.id, :conversation_id => conv.id) %></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]